Tekla Open API Reference for Tekla Structures 2025
AnalysisModelGeneralProperties.ModelCreationType Property
 The model creation type.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisModelGeneralProperties.ModelCreationTypeEnum ModelCreationType { get; set; }
Public Property ModelCreationType As AnalysisModelGeneralProperties.ModelCreationTypeEnum
	Get
	Set
Property Value
Type: AnalysisModelGeneralProperties.ModelCreationTypeEnum
See Also
Reference
AnalysisModelGeneralProperties Class
Tekla.Structures.Analysis Namespace